Белгипрозем_2017/src/InformationRegisters/ДескрипторыДоступаДляФайлов/ДескрипторыДоступаДляФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДескрипторыДоступаДляФайлов</name>
  <resources>
    <name>Дескриптор</name>
    <type>
      <types>CatalogRef.ДескрипторыДоступаФайлов</types>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>CatalogRef.ПапкиФайлов</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.СообщенияЭДО</types>
      <types>CatalogRef.Мероприятия</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/CommonForms/ДокументооборотПраваДоступаПоФайлу/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ОбъектДоступа) = Тип("СправочникСсылка.Файлы") Тогда
		ОбъектДоступа = Параметры.ОбъектДоступа;
	ИначеЕсли ТипЗнч(Параметры.ОбъектДоступа) = Тип("СправочникСсылка.ВерсииФайлов") Тогда
		ОбъектДоступа = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Параметры.ОбъектДоступа, "Владелец");
	КонецЕсли;	
	
	Дескриптор = РегистрыСведений.ДескрипторыДоступаДляФайлов.НайтиДескрипторДляФайла(ОбъектДоступа);
	УникальныйИдентификаторДескриптора = Строка(Дескриптор.УникальныйИдентификатор());
	
	ЗаполнитьТаблицуПрав();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСервер()
	
	Дескриптор = ДокументооборотПраваДоступа.ОпределитьДескрипторДоступаФайлаПоВладельцу(ОбъектДоступа.ВладелецФайла);
	УникальныйИдентификаторДескриптора = Строка(Дескриптор.УникальныйИдентификатор());
	
	Если ЗначениеЗаполнено(Дескриптор) Тогда
		
		МенеджерДескриптора = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Дескриптор);
		МенеджерДескриптора.ОбновитьПрава(
			Дескриптор,
			Неопределено, // Протокол
			Истина); // Немедленно
		
	КонецЕсли;	
	
	ЗаполнитьТаблицуПрав();
	
КонецПроцедуры

&НаСервере	
Процедура ЗаполнитьТаблицуПрав()
	
	ТаблицаПрав = ДокументооборотПраваДоступа.ПолучитьТаблицуПравДляОтображенияВИнтерфейсе(ОбъектДоступа);
	ПраваДоступа.Загрузить(ТаблицаПрав);
	
КонецПроцедуры

&НаКлиенте
Процедура ПраваДоступаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПраваДоступа.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,ТекущиеДанные.Пользователь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УникальныйИдентификаторДескриптораНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Дескриптор);
	
КонецПроцедуры
